# ExtElemChangeBeamSectionRegistry Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExtElemChangeBeamSectionRegistry Class
Members See Also
---
An object that stores IExtElemChangeBeamSection
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class ExtElemChangeBeamSectionRegistry : IDisposable
```

Visual Basic
---
```text
Public Class ExtElemChangeBeamSectionRegistry _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExtElemChangeBeamSectionRegistry : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..ExtElemChangeBeamSectionRegistry
# See Also
ExtElemChangeBeamSectionRegistry Members
Autodesk.Revit.DB.Structure Namespace